kk6axq/smartreel/esp32-hmi/src/app/inv_sync.cpp
#include "app/inv_sync.h"

#include "net/inv_api.h"
#include "net/wifi_mgr.h"
#include "app/hw_mirror.h"
#include "app/slot_map.h"
#include "app/leds.h"
#include "ui/app_state.h"
#include "ui/anomaly_modal.h"
#include "ui/locate_overlay.h"
#include "ui/screen_manager.h"
#include "util/lvgl_async.h"

#include <Arduino.h>
#include <freertos/FreeRTOS.h>
#include <freertos/task.h>
#include <freertos/semphr.h>
#include <esp32-hal-log.h>
#include <string.h>
#include <stdio.h>

// state_store dirty-marking (forward decls; see app_state.cpp for why
// we don't include state_store.h here).
namespace state_store {
    void mark_slot_dirty(int slot_num);
    void mark_jobs_dirty();
}

// Action log to the USB serial console, always on (independent of
// CORE_DEBUG_LEVEL) so it can be captured and pasted back during bench
// bring-up. Greppable "[inv]" prefix; one line per meaningful action.
#define SR_LOG(fmt, ...) Serial.printf("[inv] " fmt "\n", ##__VA_ARGS__)

namespace inv_sync {

namespace {

// ---- Intervals ------------------------------------------------------
constexpr uint32_t TICK_MS            = 500;
constexpr uint32_t HEALTH_OK_IVL_MS   = 15000;   // re-check while online
constexpr uint32_t HEALTH_BAD_IVL_MS  = 5000;    // retry faster while down
constexpr uint32_t RACK_IVL_MS        = 60000;   // periodic reconcile
constexpr uint32_t ONLINE_WINDOW_MS   = 45000;   // health age that still counts as online
constexpr int      OP_MAX_ATTEMPTS    = 20;      // transient-failure retries per op

// ---- Mutation queue --------------------------------------------------
enum class OpType : uint8_t { Assign, Pick, JobPick, Clear, Anomaly, LocateAck };

// Max locate ids carried in a single ack op. The plugin caps its queue at
// 50; one poll can surface at most that many, and we ack what we lit.
constexpr int ACK_IDS_CAP = 50;

struct Op {
    OpType  type;
    int     slot;
    int     stock_id;       // Assign
    int     item_idx;       // JobPick
    char    job_id[12];     // JobPick
    char    text[96];       // Clear: reason / Anomaly: detail
    char    kind[10];       // Anomaly
    char    op_id[40];
    int     ack_ids[ACK_IDS_CAP];   // LocateAck
    int     n_ack_ids;              // LocateAck
    uint8_t attempts;
};

constexpr int QUEUE_CAP = 16;
Op  g_queue[QUEUE_CAP];
int g_q_head = 0, g_q_count = 0;
SemaphoreHandle_t g_q_mutex = nullptr;

// ---- Worker flags -----------------------------------------------------
volatile bool g_want_jobs = false;
volatile bool g_want_rack = false;
volatile bool g_registered = false;

// Online tracking (written by worker, read by UI -- single word).
volatile bool     g_online = false;
volatile uint32_t g_last_health_ok = 0;

bool q_push(const Op& op) {
    bool ok = false;
    xSemaphoreTake(g_q_mutex, portMAX_DELAY);
    if (g_q_count < QUEUE_CAP) {
        g_queue[(g_q_head + g_q_count) % QUEUE_CAP] = op;
        g_q_count++;
        ok = true;
    }
    xSemaphoreGive(g_q_mutex);
    if (!ok) {
        log_e("inv_sync: op queue full, dropping %d (slot %d)", (int)op.type, op.slot);
    }
    return ok;
}

bool q_peek(Op& out) {
    bool ok = false;
    xSemaphoreTake(g_q_mutex, portMAX_DELAY);
    if (g_q_count > 0) { out = g_queue[g_q_head]; ok = true; }
    xSemaphoreGive(g_q_mutex);
    return ok;
}

void q_pop() {
    xSemaphoreTake(g_q_mutex, portMAX_DELAY);
    if (g_q_count > 0) { g_q_head = (g_q_head + 1) % QUEUE_CAP; g_q_count--; }
    xSemaphoreGive(g_q_mutex);
}

void q_bump_attempts() {
    xSemaphoreTake(g_q_mutex, portMAX_DELAY);
    if (g_q_count > 0) g_queue[g_q_head].attempts++;
    xSemaphoreGive(g_q_mutex);
}

Op make_op(OpType t) {
    Op op{};
    op.type = t;
    inv_api::make_op_id(op.op_id, sizeof(op.op_id));
    return op;
}

// Enqueue a POST /rack/locates/ack for the given ids. Routed through the
// op queue like every other outbound write, so it retries on a transient
// failure and respects ordering. No op_id is needed (ack is idempotent by
// set-difference, not op_id-cached -- locate ids originate in InvenTree),
// but make_op() stamping one is harmless and keeps the path uniform.
void queue_locate_ack(const int* ids, int n) {
    if (n <= 0) return;
    if (n > ACK_IDS_CAP) n = ACK_IDS_CAP;
    Op op = make_op(OpType::LocateAck);
    op.n_ack_ids = n;
    for (int i = 0; i < n; ++i) op.ack_ids[i] = ids[i];
    SR_LOG("queue locate-ack (%d ids)", n);
    q_push(op);
}

// ---- Op execution -----------------------------------------------------
// Returns true when the op is finished (success OR permanent rejection)
// and should be popped; false to keep it queued for retry.
bool run_op(const Op& op) {
    inv_api::SlotMutResult r{};
    inv_api::JobPickResult jr{};
    inv_api::Status st;
    const char* what = "?";

    switch (op.type) {
        case OpType::Assign:
            what = "assign";
            r  = inv_api::assign_slot(op.slot, op.stock_id, op.op_id);
            st = r.status;
            break;
        case OpType::Pick:
            what = "pick";
            r  = inv_api::pick_slot(op.slot, op.op_id);
            st = r.status;
            break;
        case OpType::JobPick:
            what = "job-pick";
            jr = inv_api::pick_job_item(op.job_id, op.item_idx, op.slot, op.op_id);
            st = jr.status;
            break;
        case OpType::Clear:
            what = "clear";
            r  = inv_api::clear_slot(op.slot, op.text, op.op_id);
            st = r.status;
            break;
        case OpType::Anomaly:
            what = "anomaly";
            r  = inv_api::report_anomaly(op.kind, op.slot, op.text, op.op_id);
            st = r.status;
            break;
        case OpType::LocateAck:
            what = "locate-ack";
            r  = inv_api::ack_locates(op.ack_ids, op.n_ack_ids);
            st = r.status;
            break;
        default:
            return true;
    }

    if (st == inv_api::Status::Ok) {
        SR_LOG("op %s slot=%d OK (op_id=%s)", what, op.slot, op.op_id);
        return true;
    }
    if (st == inv_api::Status::BadStatus) {
        // Server actively rejected it (409/404/...). Retrying won't
        // help; the periodic rack reconcile will surface the drift.
        const char* err = (op.type == OpType::JobPick) ? jr.error : r.error;
        SR_LOG("op %s slot=%d REJECTED: %s", what, op.slot, err);
        return true;
    }
    // Transient (no wifi / network / timeout / not configured): retry,
    // but cap attempts so a permanently broken op can't wedge the queue.
    if (op.attempts + 1 >= OP_MAX_ATTEMPTS) {
        SR_LOG("op %s slot=%d DROPPED after %d attempts (%s)",
               what, op.slot, op.attempts + 1, inv_api::status_str(st));
        return true;
    }
    SR_LOG("op %s slot=%d retry (%s, attempt %d)",
           what, op.slot, inv_api::status_str(st), op.attempts + 1);
    return false;
}

// ---- Rack reconciliation (runs on the LVGL task) ----------------------
//
// Server-authoritative and NON-DESTRUCTIVE: reconcile adopts InvenTree's
// view into local state and, at most, raises a LOCAL anomaly. It never
// pushes a clear/pick to the server — physical removals are detected by
// the RS485 event path (apply_slot_change in main.cpp), not here, so a
// flaky slot sensor (or a reel placed via the on-screen dot) can't make
// reconcile dump freshly-placed stock into the pulled bin.
//
// Per slot:
//   server occupied            -> adopt part/qty, mark confirmed. (A reel
//        the HMI just assigned lands here once the assign completes,
//        whether or not the slot sensor reads it.)
//   server empty + local has a CONFIRMED part -> the reel was moved in
//        InvenTree behind our back: drop the local part; if it's still
//        physically here, light it amber + raise "remove it".
//   server empty + local part NOT confirmed   -> a locally-placed reel
//        the server hasn't acknowledged yet (assign pending / unsynced):
//        leave it alone.
//   server empty + local empty -> nothing.
//
// Slots in an active workflow (TARGET/PICKED) are skipped.

bool slot_physically_present(const app::Slot& s) {
    for (int w = 0; w < s.width; ++w) {
        int pix = s.module * app::SlotMap::SLOTS_PER_MODULE + s.mslot + w;
        if (hw_mirror::slot_present(s.port,
                                    pix / app::SlotMap::SLOTS_PER_MODULE,
                                    pix % app::SlotMap::SLOTS_PER_MODULE))
            return true;
    }
    return false;
}

void copy_part(app::Part& dst, const inv_api::Part& src) {
    snprintf(dst.id,   sizeof(dst.id),   "%s", src.id);
    snprintf(dst.name, sizeof(dst.name), "%s", src.name);
    snprintf(dst.pkg,  sizeof(dst.pkg),  "%s", src.pkg);
    snprintf(dst.mfg,  sizeof(dst.mfg),  "%s", src.mfg);
    dst.valid = true;
}

