kk6axq/smartreel/esp32-hmi/src/app/inv_sync.cpp
void raise_moved_anomaly(int slot_num) {
    auto& st = app::state();
    app::lock();
    app::Anomaly& a = st.anomaly;
    a.kind = app::AnomalyKind::Added;     // non-latching; removal resolves it
    a.mood = app::AnomalyMood::Warn;
    snprintf(a.title, sizeof(a.title), "Stock moved in InvenTree");
    snprintf(a.message, sizeof(a.message),
             "A reel in this rack was moved to another location in "
             "InvenTree without being removed. Take it out of the lit slot.");
    a.n_detail = 0;
    snprintf(a.detail[a.n_detail].k, sizeof(a.detail[0].k), "Slot");
    snprintf(a.detail[a.n_detail].v, sizeof(a.detail[0].v), "#%d", slot_num);
    a.n_detail++;
    snprintf(a.detail[a.n_detail].k, sizeof(a.detail[0].k), "Action");
    snprintf(a.detail[a.n_detail].v, sizeof(a.detail[0].v), "Remove the reel");
    a.n_detail++;
    st.anomaly_visible = true;
    app::unlock();
    ui::anomaly_modal_open_current();
}

// "Has the server ever confirmed this slot occupied?" — the moved-in-
// InvenTree detection only makes sense for a reel the server previously
// knew about. A freshly-placed reel whose assign is still in flight (or a
// local-only / simulated placement with no stock id) was never confirmed,
// so reconcile must not mistake it for one that was moved away. Touched
// only on the LVGL task (apply_rack_result), so no lock needed.
static bool g_server_confirmed[app::MAX_LOGICAL_SLOTS + 1] = {};

static void set_confirmed(int slot_num, bool v) {
    if (slot_num >= 0 && slot_num <= app::MAX_LOGICAL_SLOTS)
        g_server_confirmed[slot_num] = v;
}
static bool is_confirmed(int slot_num) {
    return slot_num >= 0 && slot_num <= app::MAX_LOGICAL_SLOTS
           && g_server_confirmed[slot_num];
}

void apply_rack_result(void* user) {
    auto* rr = static_cast<inv_api::RackResult*>(user);
    auto& st = app::state();

    // A mutation queued (or in flight) between the worker's fetch and this
    // apply means local state is intentionally ahead of the snapshot — skip
    // rather than reconcile against stale truth. (The worker also gates the
    // fetch on an empty queue; this catches the dispatch-window race.)
    if (pending_ops() > 0) { delete rr; return; }

    const bool have_physical = hw_mirror::valid();
    int n_occ = 0, n_adopt = 0, n_moved = 0, n_clearlocal = 0;

    bool changed = false;
    for (int i = 0; i < rr->n_slots; ++i) {
        const inv_api::RackSlot& srv = rr->slots[i];

        // Hold the lock across the shared-state reads (slot_by_num's scan of
        // st.rack, the slot->state/part/qty reads, and any mutation) so we
        // never tear against the state_store writer task snapshotting under
        // the same mutex. Decisions are computed here, then acted on (logging,
        // dirty-marking, LEDs, anomaly) AFTER unlock to keep the critical
        // section minimal and avoid holding the lock across slow/blocking work
        // (raise_moved_anomaly re-takes app::lock(), so it must run unlocked).
        bool did_adopt = false, did_moved = false, did_clearlocal = false;
        app::lock();
        app::Slot* slot = app::slot_by_num(srv.slot);
        if (!slot) { app::unlock(); continue; }    // not an anchor of a logical slot
        if (slot->state == app::SlotState::TARGET ||
            slot->state == app::SlotState::PICKED) {
            app::unlock();
            continue;                              // active workflow owns it
        }

        const bool present = have_physical && slot_physically_present(*slot);

        if (srv.occupied) {
            n_occ++;
            // Server is the inventory of record; adopt its metadata and
            // remember that it vouches for this slot. We do NOT clear on a
            // physically-absent sensor reading — that's the bug that dumped
            // freshly-assigned reels into the pulled bin.
            set_confirmed(srv.slot, true);
            if (!slot->part.valid || slot->qty != srv.qty ||
                strcmp(slot->part.id, srv.part.id) != 0) {
                copy_part(slot->part, srv.part);
                slot->qty   = srv.qty;
                slot->state = app::SlotState::OCCUPIED;
                did_adopt = true;
            }
        } else if (slot->part.valid && is_confirmed(srv.slot)) {
            // Server PREVIOUSLY confirmed this reel and now reports the slot
            // empty → it was moved in InvenTree behind our back. Drop the
            // local part; if the reel is still physically here, light it and
            // tell the user to remove it (user-stories.md). Confirmed-gate
            // keeps this off a just-placed/unsynced reel.
            set_confirmed(srv.slot, false);
            slot->part.valid = false;
            slot->qty        = 0;
            slot->state      = present ? app::SlotState::WARN : app::SlotState::EMPTY;
            if (present) did_moved = true;
            else         did_clearlocal = true;
        }
        // server empty + local part NOT confirmed: a locally-placed reel the
        // server hasn't acknowledged yet (assign pending / unsynced). Leave
        // it — the assign op syncs it, then a later reconcile confirms it.
        app::unlock();

        // Side effects, outside the lock.
        if (did_adopt) {
            state_store::mark_slot_dirty(srv.slot);
            SR_LOG("reconcile slot=%d adopt %s qty=%d (present=%d)",
                   srv.slot, srv.part.id, srv.qty, present);
            n_adopt++;
            changed = true;
        } else if (did_moved) {
            state_store::mark_slot_dirty(srv.slot);
            leds::light_slot(srv.slot, 0xF5, 0x9E, 0x0B);   // amber: remove me
            raise_moved_anomaly(srv.slot);
            // Record the move in InvenTree's anomaly log too (mirrors the
            // hardware-removal path in main.cpp), not just the local modal.
            inv_sync::queue_anomaly("moved", srv.slot, "stock moved in InvenTree, still present");
            SR_LOG("reconcile slot=%d MOVED in InvenTree, still present -> remove", srv.slot);
            n_moved++;
            changed = true;
        } else if (did_clearlocal) {
            state_store::mark_slot_dirty(srv.slot);
            SR_LOG("reconcile slot=%d gone from InvenTree and absent -> clear local", srv.slot);
            n_clearlocal++;
            changed = true;
        }
    }

    SR_LOG("reconcile: %d slots (%d server-occupied) adopt=%d moved=%d cleared-local=%d phys=%d",
           rr->n_slots, n_occ, n_adopt, n_moved, n_clearlocal, have_physical);

    // ---- Pending locate requests (web-UI "locate" button) -------------
    // We're on the LVGL task and the fetch succeeded (worker only dispatches
    // here on Status::Ok), so it is safe to drive the overlay/LEDs and we are
    // genuinely online. For each pending locate, light the slot persistently
    // (locate_overlay owns the active-locate state and keeps it lit across
    // polls until the operator dismisses -- an empty locates[] on a later poll
    // does NOT clear it). Then ack the ids we handled so the server queue
    // drains and they don't re-light on the next poll. Lighting persistence
    // (local) and ack (server) are independent: ack only stops re-delivery.
    if (rr->n_locates > 0) {
        int ack_ids[inv_api::RackResult::MAX_LOCATES];
        int n_ack = 0;
        for (int i = 0; i < rr->n_locates; ++i) {
            const inv_api::Locate& loc = rr->locates[i];
            if (loc.slot_num > 0)
                ui::locate_overlay_add(loc.slot_num);   // persistent highlight
            if (loc.id > 0 && n_ack < (int)(sizeof(ack_ids)/sizeof(ack_ids[0])))
                ack_ids[n_ack++] = loc.id;
        }
        if (n_ack > 0) {
            queue_locate_ack(ack_ids, n_ack);
            SR_LOG("locate: lit %d slot(s), acking %d id(s)", rr->n_locates, n_ack);
        }
    }

    if (changed && (ui::current() == ui::Screen::Home ||
                    ui::current() == ui::Screen::View ||
                    ui::current() == ui::Screen::RackGrid)) {
        ui::rebuild_current();
    }
    delete rr;
}

// ---- Pick jobs apply (LVGL task) --------------------------------------

