kk6axq/smartreel/esp32-hmi/src/app/inv_sync.cpp
void apply_jobs_result(void* user) {
    auto* jr = static_cast<inv_api::PickJobsResult*>(user);
    auto& st = app::state();

    // Never reshape the job list under an active job: indices would
    // shift mid-pick. The list refreshes on the next screen entry. Read
    // active_pick_idx under the lock -- it is mutated by other state
    // mutators (e.g. mock_start_pick) holding the same mutex.
    app::lock();
    if (st.active_pick_idx >= 0) {
        app::unlock();
        delete jr;
        return;
    }

    st.n_pick_jobs = 0;
    for (int i = 0; i < jr->n_jobs && st.n_pick_jobs < app::MAX_PICK_JOBS; ++i) {
        const inv_api::PickJobInfo& src = jr->jobs[i];
        if (strcmp(src.job_status, "done") == 0) continue;   // finished jobs hide
        app::PickJob& dst = st.pick_jobs[st.n_pick_jobs++];
        snprintf(dst.id,   sizeof(dst.id),   "%s", src.id);
        snprintf(dst.name, sizeof(dst.name), "%s", src.name);
        // ISO "2026-06-11T14:02:00" -> "14:02" for the row meta.
        if (strlen(src.requested) >= 16)
            snprintf(dst.requested, sizeof(dst.requested), "%.5s", src.requested + 11);
        else
            snprintf(dst.requested, sizeof(dst.requested), "%s", src.requested);
        snprintf(dst.status, sizeof(dst.status), "%s", src.job_status);
        dst.n_items = 0;
        for (int k = 0; k < src.n_items && dst.n_items < 16; ++k) {
            app::PickItem& it = dst.items[dst.n_items++];
            snprintf(it.part_id,   sizeof(it.part_id),   "%s", src.items[k].part_id);
            snprintf(it.part_name, sizeof(it.part_name), "%s", src.items[k].part_name);
            it.qty      = src.items[k].qty;
            it.picked   = src.items[k].picked;
            it.slot_num = 0;     // resolved against the local rack below
        }
    }

    // Still under the lock: resolve_pick_locations() scans st.rack (via
    // find_part) and writes st.pick_jobs[].items[].slot_num, so it must run
    // inside the same critical section (matches mock_start_pick()).
    for (int i = 0; i < st.n_pick_jobs; ++i)
        app::resolve_pick_locations(st.pick_jobs[i]);
    app::unlock();

    state_store::mark_jobs_dirty();
    if (ui::current() == ui::Screen::PickList) ui::rebuild_current();
    delete jr;
}

// ---- Worker -----------------------------------------------------------

int physical_slot_count() {
    int total = 0;
    for (int p = 0; p < hw_mirror::N_PORTS; ++p)
        total += hw_mirror::module_count(p) * app::SlotMap::SLOTS_PER_MODULE;
    return total > 0 ? total : 64;   // sane default before topology known
}

void set_online(bool on) {
    bool was = g_online;
    g_online = on;
    if (on) g_last_health_ok = millis();
    if (was != on) {
        SR_LOG("%s InvenTree", on ? "ONLINE ->" : "OFFLINE ->");
        // app_state.online drives the status bar pill. Cheap bool write
        // marshalled to the LVGL task with the existing dispatcher.
        ui::dispatch_on_lvgl([](void* v) {
            app::state().online = (v != nullptr);
            ui::rebuild_current();
        }, on ? (void*)1 : nullptr);
    }
}

void worker(void*) {
    uint32_t next_health = 0;
    uint32_t next_rack   = 0;

    for (;;) {
        vTaskDelay(pdMS_TO_TICKS(TICK_MS));
        if (!inv_api::configured()) {
            g_registered = false;
            set_online(false);
            continue;
        }

        const uint32_t now = millis();

        // Health (+ registration on transition to online).
        if ((int32_t)(now - next_health) >= 0) {
            inv_api::HealthResult h = inv_api::health();
            const bool ok = (h.status == inv_api::Status::Ok);
            set_online(ok);
            next_health = now + (ok ? HEALTH_OK_IVL_MS : HEALTH_BAD_IVL_MS);
            if (ok && !g_registered) {
                char op_id[40];
                inv_api::make_op_id(op_id, sizeof(op_id));
                auto r = inv_api::register_rack(physical_slot_count(), op_id);
                if (r.status == inv_api::Status::Ok) {
                    g_registered = true;
                    g_want_rack  = true;   // boot sync right after registration
                    SR_LOG("registered rack (%d slots)", physical_slot_count());
                } else {
                    SR_LOG("register FAILED: %s", r.error);
                }
            }
        }

        if (!g_online) continue;

        // Drain the mutation queue first: ordering matters (an assign
        // queued before a pick of the same slot must land first).
        Op op;
        while (q_peek(op)) {
            if (run_op(op)) {
                q_pop();
            } else {
                q_bump_attempts();
                break;            // transient failure: retry next tick
            }
        }

        // Rack reconcile: periodic + on demand — but only when the queue
        // drained fully this tick. A non-empty queue means an assign/pick
        // hasn't landed, so the server snapshot is stale w.r.t. local intent
        // and reconciling would raise false anomalies. Leaving the timer/
        // flag as-is retries next tick once the op clears.
        if ((g_want_rack || (int32_t)(now - next_rack) >= 0)
            && pending_ops() == 0) {
            g_want_rack = false;
            next_rack   = now + RACK_IVL_MS;
            auto* rr = new (std::nothrow) inv_api::RackResult();
            if (rr) {
                inv_api::get_rack(*rr);
                if (rr->status == inv_api::Status::Ok) {
                    ui::dispatch_on_lvgl(apply_rack_result, rr);
                } else {
                    SR_LOG("GET /rack FAILED: %s", rr->error);
                    delete rr;
                }
            }
        }

        // Pick jobs: on demand only.
        if (g_want_jobs) {
            g_want_jobs = false;
            auto* jr = new (std::nothrow) inv_api::PickJobsResult();
            if (jr) {
                inv_api::get_pickjobs(*jr);
                if (jr->status == inv_api::Status::Ok) {
                    SR_LOG("GET /pickjobs OK (%d jobs)", jr->n_jobs);
                    ui::dispatch_on_lvgl(apply_jobs_result, jr);
                } else {
                    SR_LOG("GET /pickjobs FAILED: %s", jr->error);
                    delete jr;
                }
            }
        }
    }
}

